БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗакрытиеФинансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗакрытиеФинансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ОбработкаДвойногоКликаВПодборе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ОбработкаДвойногоКликаВПодборе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открытие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипДокумента 	= Параметры.ТипДокумента;
	Валюта 			= Параметры.Валюта;
	Грузоперевозки 	= Параметры.Грузоперевозки;
	
	ИспользованиеЗаказов = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	
	Параметры.Свойство("РаздельныйУчетВходящегоНДС"			, РаздельныйУчетВходящегоНДС);
	Параметры.Свойство("ГруппировкаЗатратПоПодразделениям"	, ГруппировкаЗатратПоПодразделениям);
	// --- 
	ДС.Добавить(Новый Структура);
	// --- 
	
	_УстановитьСписокПараметров();
	_ОбновитьСписокДополнительныхКолонок();
	
	Настройки = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма);
	Если Настройки <> Неопределено Тогда
		
		Попытка
			
			Если Настройки.Свойство("ТекущийПараметр") Тогда
				ПараметрПоиска = Настройки.ТекущийПараметр;
			КонецЕсли;
			
			Если Настройки.Свойство("ВыбранныеКолонки") Тогда
				Для Каждого ЭлементМассива из Настройки.ВыбранныеКолонки Цикл
					ЭлементСписка = СписокДопКолонок.НайтиПоЗначению(ЭлементМассива);
					ЭлементСписка.Пометка = истина;
				КонецЦикла;
				ДополнитьКолонкиПоиска();
			КонецЕсли;
			
			_ПараметрПоискаПриИзменении();
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
	КонецЕсли; 

	Если Грузоперевозки <> Неопределено Тогда
		
		// проверяем, что среди переданных нет закрытых
		МассивАналитик = Новый Массив;
		Для каждого Стр Из Грузоперевозки Цикл
			
			_сф.м_ДобавитьУникально(МассивАналитик,?(ЗначениеЗаполнено(Стр.Заказ),Стр.Заказ,Стр));
			
		КонецЦикла; 
		ТаблицаЗакрытых = CW_Мониторинг.ТаблицаЗакрытыхПоАналитике(МассивАналитик);
	
		Для каждого Стр Из Грузоперевозки Цикл
			
			Аналитика = ?(ЗначениеЗаполнено(Стр.Заказ),Стр.Заказ,Стр);
			Если ТаблицаЗакрытых.Найти(Аналитика,"Аналитика") <> Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли; 
			Нстр = ТаблицаПодбора.Добавить();
			Нстр.Грузоперевозка = Стр.CW_Представление;
			Нстр.Номер = Стр.Код;
			Нстр.Дата = Стр.ДатаСделкиФ;
			Нстр.Клиент = Стр.Клиент;
			Нстр.Ссылка = Стр;
			Нстр.ПометкаУдаления = Стр.ПометкаУдаления;
			Нстр.Заказ = Стр.Заказ;
			Нстр.ИндексКартинки = ?(Стр.ПометкаУдаления,4,3);
						
		КонецЦикла; 
		
	КонецЕсли; 
	
	ЗаполнитьЗначенияДополнительныхКолонок("РезультатПоиска",Грузоперевозки);
	ЗаполнитьЗначенияДополнительныхКолонок("ТаблицаПодбора",Грузоперевозки);

	// --- 
	Параметры.Свойство("Договор",Договор);
	Параметры.Свойство("ДатаДокумента",ДатаДокумента);
	
	//Подсистема.УчетПриложенийДоговоров
	Параметры.Свойство("ПриложениеКДоговору",ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	РежимДвойногоКликаП = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"РежимДвойногоКликаВФормеПодбора");
	Если РежимДвойногоКликаП <> Неопределено Тогда
		
		РежимДвойногоКлика = РежимДвойногоКликаП;
		
	Иначе
		
		РежимДвойногоКлика = Перечисления.CW_ОбработкаДвойногоКликаВПодборе.Подбор;
		
	КонецЕсли; 
		
	ОбновитьЗаголовокПодбора();
	
	// --- 
	Элементы.ТаблицаПодбораЗаполнитьПоБюджету.Видимость 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	
	
	Если НЕ ПустаяСтрока(ПараметрПоиска) Тогда
		СП = _ДС().СоответствиеПараметров.Получить(ПараметрПоиска);
		УстановитьВидимостьЭлементовПоискаПопараметрамЗаказа(СП.Значение);
	КонецЕсли;
	
	//Работа с буфером обмена  
	// Проверка буфера обмена на наличие скопированных строк
	ДоступностьКоманды = ПолучитьДоступностьКомандыБуфераОбмена();
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, ДоступностьКоманды);
	//Работа с буфером обмена
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоискаПопараметрамЗаказа(ЗначениеПоиска)
	
	Элементы.НеИскатьЗначениеПараметраПоЗаказам.Видимость 	= ТипЗнч(ЗначениеПоиска) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"); 
	Элементы.РезультатПоискаПоЗаказу.Видимость 				= ТипЗнч(ЗначениеПоиска) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок")
																И НЕ НеИскатьЗначениеПараметраПоЗаказам;

КонецПроцедуры

Функция ПолучитьЗначенияДополнительныхКолонокТаблицыПодбора(ВыбранныеКолонки, мГрузоперевозки)
	
	мПараметры = Новый Массив;
	мРеквизиты = Новый Массив;
	
	СоответствиеПараметров = _ДС().СоответствиеПараметров;	
	
	Для Каждого ЭлементМассива из ВыбранныеКолонки Цикл
		СтрокаСоответствия = СоответствиеПараметров.Получить(ЭлементМассива);
		Если СтрокаСоответствия <> Неопределено Тогда
			Если СтрокаСоответствия.ЭтоПараметр Тогда
				мПараметры.Добавить(СтрокаСоответствия.Значение);
			Иначе
				мРеквизиты.Добавить(СтрокаСоответствия.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ";
	
	Для Каждого ЭлементМассива из мРеквизиты Цикл
		Запрос.Текст = Запрос.Текст + "			   
		|	CW_Грузоперевозки."+ЭлементМассива+" КАК "+ЭлементМассива+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "			   
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Ссылка В(&мГрузоперевозки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	|	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	|	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_Параметры
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|ГДЕ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка В(&мГрузоперевозки)
	|	И CW_ХарактеристикиГрузоперевозок.Параметр В(&мПараметры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.Ссылка КАК Грузоперевозка,";
	
	Для Каждого ЭлементМассива из мРеквизиты Цикл
		Запрос.Текст = Запрос.Текст + "			   
		|	ВТ_Грузоперевозки."+ЭлементМассива+" КАК "+ЭлементМассива+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "			   
	|	ЕСТЬNULL(ВТ_Параметры.Параметр, НЕОПРЕДЕЛЕНО) КАК Параметр,
	|	ЕСТЬNULL(ВТ_Параметры.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Параметры КАК ВТ_Параметры
	|		ПО ВТ_Грузоперевозки.Ссылка = ВТ_Параметры.Грузоперевозка";
	
	Запрос.УстановитьПараметр("мГрузоперевозки"	, мГрузоперевозки);
	Запрос.УстановитьПараметр("мПараметры"		, мПараметры);
	
	Возврат запрос.Выполнить().Выбрать();
	
КонецФункции


// ---------------------------------------------------------------------------- 

Функция _ДС()
	// --- 
	
	Возврат(ДС[0].Значение);
	
	// --- 
КонецФункции
  

&НаСервере
Процедура _УстановитьСписокПараметров()
	// --- 
	
	Индекс = 0;
	ТЗП = _сф.т_Создать("Ключ,Значение,Представление");
	
	_сф.Инкремент(Индекс);
	Нстр = ТЗП.Добавить();
	Нстр.Ключ = _Ключ(Индекс);
	Нстр.Значение = Тип("СправочникСсылка.Контрагенты");
	Нстр.Представление = "Клиент";
	
	Если ИспользованиеЗаказов Тогда
		
		_сф.Инкремент(Индекс);
		Нстр = ТЗП.Добавить();
		Нстр.Ключ = _Ключ(Индекс);
		Нстр.Значение = Тип("СправочникСсылка.CW_Заказы");
		Нстр.Представление = "Заказ";

	КонецЕсли; 
	
	_сф.Инкремент(Индекс);
	Нстр = ТЗП.Добавить();
	Нстр.Ключ = _Ключ(Индекс);
	Нстр.Значение = Тип("СправочникСсылка.CW_Грузоперевозки");
	Нстр.Представление = "Грузоперевозка";
	
	// дата ГП
	_сф.Инкремент(Индекс);
	Нстр 				= ТЗП.Добавить();
	Нстр.Ключ 			= _Ключ(Индекс);
	Нстр.Значение		= Тип("Дата");
	Нстр.Представление 	= "Дата грузоперевозки (По значению)";
	
	_сф.Инкремент(Индекс);
	Нстр 				= ТЗП.Добавить();
	Нстр.Ключ 			= _Ключ(Индекс);
	Нстр.Значение 		= Тип("Дата");
	Нстр.Представление 	= "Дата грузоперевозки (В интервале)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Наименование КАК Наименование
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		_сф.Инкремент(Индекс);
		
		Нстр = ТЗП.Добавить();
		Нстр.Ключ 			= _Ключ(Индекс);
		Нстр.Значение 		= Выборка.Ссылка;
		Нстр.Представление 	= Выборка.Наименование;
		
	КонецЦикла;  
	
	// ---------------------------------------------------------------------------- 
	
	_ДС().Вставить("СоответствиеПараметров",_сф.со_Создать("Ключ","Ключ,Значение,Представление",ТЗП));
	// --- 
	Элементы.ПараметрПоиска.СписокВыбора.Очистить();
	Для каждого Стр Из ТЗП Цикл
		
		Элементы.ПараметрПоиска.СписокВыбора.Добавить(Стр.Ключ,Стр.Представление);
		
	КонецЦикла; 
	// --- 
	ПараметрПоиска = _сф.к_ПервыйЭлемент(ТЗП).Ключ;
	_ПараметрПоискаПриИзменении();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСписокДополнительныхКолонок()
	
	СоответствиеПараметров = _ДС().СоответствиеПараметров;
	
	СписокДопКолонок.Очистить();
	
	Справочники.CW_Грузоперевозки.ПолучитьСписокРеквизитовШапкиДляВыводаНаФорму(СоответствиеПараметров, СписокДопКолонок);
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучиьСписокПараметровДляВыводаНаФорму(СоответствиеПараметров, СписокДопКолонок);
	
	//Для каждого СтрокаСоответствия из СоответствиеПараметров Цикл
	//	ЗначениеСоответствия = СтрокаСоответствия.Значение;
	//	СписокДопКолонок.Добавить(СтрокаСоответствия.Ключ,ЗначениеСоответствия.Представление, Ложь);
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция _Ключ(Номер)
	// --- 
	
	Возврат(Формат(Номер,"ЧЦ=10; ЧДЦ=0; ЧГ="));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПараметрПоискаПриИзменении(Элемент)
	
	_ПараметрПоискаПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ПараметрПоискаПриИзменении()
	// --- 
	
	РезультатПоиска.Очистить();
	
	СП = _ДС().СоответствиеПараметров.Получить(ПараметрПоиска);
	
	УстановитьВидимостьЭлементовПоискаПопараметрамЗаказа(СП.Значение);

	ВидимостьКолонкиПараметра = Ложь;
	ЗаголовокКолонкиПараметра = "";
	Если СП.Представление = "Грузоперевозка" ИЛИ СП.Представление = "Заказ" ИЛИ СП.Представление = "Клиент" 
		или СП.Представление = "Дата грузоперевозки (По значению)" или СП.Представление = "Дата грузоперевозки (В интервале)" Тогда
		
		
		ВидимостьКолонкиПараметра = Ложь;
		Если (СП.Представление = "Грузоперевозка" ИЛИ СП.Представление = "Заказ") Тогда
			
			Элементы.ПодстрокаПоиска.КнопкаВыбора=Ложь;
			ПодстрокаПоиска = "";
		
		ИначеЕсли (СП.Представление = "Клиент") Тогда 
			
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
			ПодстрокаПоиска = Справочники.Контрагенты.ПустаяСсылка();  
			
		ИначеЕсли (СП.Представление = "Дата грузоперевозки (В интервале)") Тогда 
			
			ПодстрокаПоиска = Новый СтандартныйПериод;
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
			
		ИначеЕсли (СП.Представление = "Дата грузоперевозки (По значению)") Тогда 
			
			ПодстрокаПоиска = Дата(1,1,1);
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
			
		КонецЕсли; 
		
	Иначе
		
		ВидимостьКолонкиПараметра = Истина;
		ЗаголовокКолонкиПараметра = СП.Представление;
		
		Параметр = СП.Значение;
		
		Если Параметр.ТипЗначения.Типы()[0] = Тип("Строка") Тогда
			ПодстрокаПоиска = "";
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Ложь;
		ИначеЕсли Параметр.ТипЗначения.Типы()[0] = Тип("Дата") Тогда 	
			ПодстрокаПоиска = Дата(1,1,1);
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
		ИначеЕсли Параметр.ТипЗначения.Типы()[0] = Тип("Число") Тогда 	
			ПодстрокаПоиска = 0;
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
		ИначеЕсли Параметр.ТипЗначения.Типы()[0] = Тип("Булево") Тогда
			ПодстрокаПоиска = Истина;
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
		Иначе
			ПодстрокаПоиска = Новый(Параметр.ТипЗначения.Типы()[0]);  
			Элементы.ПодстрокаПоиска.КнопкаВыбора = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Элементы.РезультатПоискаПараметр.Видимость = ВидимостьКолонкиПараметра;
	Если ВидимостьКолонкиПараметра Тогда
		
		Элементы.РезультатПоискаПараметр.Заголовок = СП.Представление;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПодстрокаПоискаПриИзменении(Элемент)
	
	_ВыполнитьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайти(Команда)
	
	_ВыполнитьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура НеИскатьЗначениеПараметраПоЗаказамПриИзменении(Элемент)
	
	СП = _ДС().СоответствиеПараметров.Получить(ПараметрПоиска);
	УстановитьВидимостьЭлементовПоискаПопараметрамЗаказа(СП.Значение);
	
	_ВыполнитьПоиск();
	
КонецПроцедуры


&НаСервере
Процедура _ВыполнитьПоиск()
	
	Если СокрЛП(ПодстрокаПоиска)="" Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	// Определим подстроку поиска
	//---------------------------------------------------------------------------------------
	
	СП = _ДС().СоответствиеПараметров.Получить(ПараметрПоиска);
	
	Подстрока_2 = Неопределено;
	
	ИскатьВЗаказах = Ложь;
	
	Если СП.Представление = "Грузоперевозка" Тогда
		
		ПараметрГП = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
		СтрокаУсловия = " И	CW_ХарактеристикиГрузоперевозок.Грузоперевозка.CW_Представление ПОДОБНО &Подстрока";
		Подстрока = Строка("%"+СокрЛП(ПодстрокаПоиска)+"%");
		
	ИначеЕсли СП.Представление = "Заказ" Тогда 
		
		ПараметрГП = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
		СтрокаУсловия = " И CW_ХарактеристикиГрузоперевозок.Грузоперевозка.Заказ.Наименование ПОДОБНО &Подстрока"; 
		Подстрока = Строка("%"+СокрЛП(ПодстрокаПоиска)+"%");
		
	ИначеЕсли (СП.Представление = "Клиент") Тогда 
		
		ПараметрГП = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
		СтрокаУсловия = " И CW_ХарактеристикиГрузоперевозок.Грузоперевозка.Клиент = &Подстрока"; 
		Подстрока = ПодстрокаПоиска; 
		
	ИначеЕсли (СП.Представление = "Дата грузоперевозки (В интервале)") Тогда 
		
		ПараметрГП = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
		СтрокаУсловия = " И	CW_ХарактеристикиГрузоперевозок.Грузоперевозка.ДатаСделкиФ МЕЖДУ &Подстрока И &Подстрока_2"; 
		Подстрока 	= ПодстрокаПоиска.ДатаНачала; 
		Подстрока_2 = ПодстрокаПоиска.ДатаОкончания; 
		
	ИначеЕсли (СП.Представление = "Дата грузоперевозки (По значению)") Тогда 
		
		ПараметрГП = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
		СтрокаУсловия = " И	CW_ХарактеристикиГрузоперевозок.Грузоперевозка.ДатаСделкиФ = &Подстрока"; 
		Подстрока = ПодстрокаПоиска; 
		
	Иначе
		
		//ищем в заказах только если указано значение параметра
		ИскатьВЗаказах = Не НеИскатьЗначениеПараметраПоЗаказам; 
		
		Параметр 	= СП.Значение;
		ПараметрГП 	= Параметр;
		Если Параметр.ТипЗначения.Типы()[0] = Тип("Строка") Тогда
			
			СтрокаУсловия = " И CW_ХарактеристикиГрузоперевозок.Значение ПОДОБНО &Подстрока ";
			Подстрока = Строка("%"+СокрЛП(ПодстрокаПоиска)+"%");
			
			СтрокаУсловияДляЗаказов = " И CW_ХарактеристикиЗаказов.Значение ПОДОБНО &Подстрока ";
			Подстрока = Строка("%"+СокрЛП(ПодстрокаПоиска)+"%");
		
		Иначе
			
			СтрокаУсловия = "И CW_ХарактеристикиГрузоперевозок.Значение = &Подстрока";
			Подстрока = ПодстрокаПоиска;
			
			СтрокаУсловияДляЗаказов = "И CW_ХарактеристикиЗаказов.Значение = &Подстрока";
			Подстрока = ПодстрокаПоиска;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;     //"+СтрокаУсловия+"
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПараметрГП", 	ПараметрГП);
	Запрос.УстановитьПараметр("Подстрока", 		Подстрока);
	Запрос.УстановитьПараметр("Подстрока_2", 	Подстрока_2);
	
	Если ИскатьВЗаказах Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
		               |	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
		               |	CW_ХарактеристикиЗаказов.Значение КАК Параметр,
		               |	ИСТИНА КАК ПоЗаказу
		               |ПОМЕСТИТЬ ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		               |		ПО CW_ХарактеристикиЗаказов.Заказ = CW_Грузоперевозки.Заказ
		               |ГДЕ
		               |	CW_ХарактеристикиЗаказов.Параметр = &ПараметрГП 
					   |	"+СтрокаУсловияДляЗаказов+"
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_ХарактеристикиЗаказов.Значение,
		               |	CW_Грузоперевозки.Ссылка,
		               |	CW_ХарактеристикиЗаказов.Заказ";
		
	Иначе
		//Просто пустая таблица, чтобы не было ошибок в запросе с отсутствием временной таблицы
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
		               |	ЗНАЧЕНИЕ(Справочник.CW_Грузоперевозки.ПустаяСсылка) КАК Ссылка,
		               |	ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка) КАК Заказ,
		               |	НЕОПРЕДЕЛЕНО КАК Параметр,
		               |	ИСТИНА КАК ПоЗаказу
		               |ПОМЕСТИТЬ ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов";
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Ссылка,
					|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка.Заказ КАК Заказ,
					|	CW_ХарактеристикиГрузоперевозок.Значение КАК Параметр,
		            |	ЛОЖЬ КАК ПоЗаказу
					|ПОМЕСТИТЬ ВТ_ГрузоперевозкиПоЗначениюПараметра
					|ИЗ
					|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
					|ГДЕ
					|	CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрГП 
					|	"+СтрокаУсловия+"
					|
					|СГРУППИРОВАТЬ ПО
					|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка,
					|	CW_ХарактеристикиГрузоперевозок.Значение
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Ссылка";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ГрузоперевозкиПоЗначениюПараметра.Ссылка КАК Ссылка,
	               |	ВТ_ГрузоперевозкиПоЗначениюПараметра.Заказ КАК Заказ,
	               |	ВТ_ГрузоперевозкиПоЗначениюПараметра.Параметр КАК Параметр,
	               |	ВТ_ГрузоперевозкиПоЗначениюПараметра.ПоЗаказу КАК ПоЗаказу,
	               |	ВЫБОР
	               |		КОГДА ВТ_ГрузоперевозкиПоЗначениюПараметра.Заказ = ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка)
	               |			ТОГДА ВТ_ГрузоперевозкиПоЗначениюПараметра.Ссылка
	               |		ИНАЧЕ ВТ_ГрузоперевозкиПоЗначениюПараметра.Заказ
	               |	КОНЕЦ КАК АналитикаЗакрытия
	               |ПОМЕСТИТЬ ВТ_ОсновноеУсловие
	               |ИЗ
	               |	ВТ_ГрузоперевозкиПоЗначениюПараметра КАК ВТ_ГрузоперевозкиПоЗначениюПараметра
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Ссылка,
	               |	ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Заказ,
	               |	ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Параметр,
	               |	ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.ПоЗаказу КАК ПоЗаказу,
	               |	ВЫБОР
	               |		КОГДА ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Заказ = ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка)
	               |			ТОГДА ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Ссылка
	               |		ИНАЧЕ ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Заказ
	               |	КОНЕЦ
	               |ИЗ
	               |	ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа КАК ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа
	               |ГДЕ
	               |	ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа.Ссылка <> ЗНАЧЕНИЕ(Справочник.CW_Грузоперевозки.ПустаяСсылка)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_ГрузоперевозокиПоЗначениюПараметраЗаказа";
	Запрос.Выполнить();
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_ГрузоперевозкиПоЗначениюПараметра";
	Запрос.Выполнить();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ОсновноеУсловие.Ссылка.Код КАК Номер,
	               |	ВТ_ОсновноеУсловие.Ссылка.CW_Представление КАК Представление,
	               |	ВТ_ОсновноеУсловие.Ссылка.ДатаСделкиФ КАК Дата,
	               |	ВТ_ОсновноеУсловие.Ссылка.Клиент КАК Клиент,
	               |	ВТ_ОсновноеУсловие.Ссылка КАК Ссылка,
	               |	ВТ_ОсновноеУсловие.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	               |	ВТ_ОсновноеУсловие.Заказ КАК Заказ,
	               |	ВТ_ОсновноеУсловие.АналитикаЗакрытия КАК АналитикаЗакрытия,
	               |	ВТ_ОсновноеУсловие.Параметр КАК Параметр,
	               |	МИНИМУМ(ВТ_ОсновноеУсловие.ПоЗаказу) КАК ПоЗаказу
	               |ПОМЕСТИТЬ ВТ_Свернуто
	               |ИЗ
	               |	ВТ_ОсновноеУсловие КАК ВТ_ОсновноеУсловие
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ОсновноеУсловие.Ссылка.CW_Представление,
	               |	ВТ_ОсновноеУсловие.Ссылка.ПометкаУдаления,
	               |	ВТ_ОсновноеУсловие.Ссылка,
	               |	ВТ_ОсновноеУсловие.Заказ,
	               |	ВТ_ОсновноеУсловие.Ссылка.Код,
	               |	ВТ_ОсновноеУсловие.АналитикаЗакрытия,
	               |	ВТ_ОсновноеУсловие.Ссылка.ДатаСделкиФ,
	               |	ВТ_ОсновноеУсловие.Ссылка.Клиент,
	               |	ВТ_ОсновноеУсловие.Параметр";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_ОсновноеУсловие";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_Свернуто.Номер КАК Номер,
	               |	ВТ_Свернуто.Представление КАК Представление,
	               |	ВТ_Свернуто.Дата КАК Дата,
	               |	ВТ_Свернуто.Клиент КАК Клиент,
	               |	ВТ_Свернуто.Ссылка КАК Ссылка,
	               |	ВТ_Свернуто.Заказ КАК Заказ,
	               |	ВТ_Свернуто.ПоЗаказу КАК ПоЗаказу,
	               |	ВТ_Свернуто.АналитикаЗакрытия КАК АналитикаЗакрытия,
	               |	ВТ_Свернуто.Параметр КАК Параметр,
	               |	ВЫБОР
	               |		КОГДА CW_ЗакрытиеФинансов.ДатаЗакрытия ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ПризнакЗакрытия,
	               |	ВЫБОР
	               |		КОГДА ВТ_Свернуто.ПометкаУдаления
	               |			ТОГДА 4
	               |		ИНАЧЕ 3
	               |	КОНЕЦ + ВЫБОР
	               |		КОГДА CW_ЗакрытиеФинансов.ДатаЗакрытия ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ 5
	               |	КОНЕЦ КАК ИндексКартинки
	               |ИЗ
	               |	ВТ_Свернуто КАК ВТ_Свернуто
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	               |		ПО ВТ_Свернуто.АналитикаЗакрытия = CW_ЗакрытиеФинансов.Аналитика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ,
	               |	Номер УБЫВ";
	
	РезультатЗапроса = запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Свернуто.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВТ_Свернуто КАК ВТ_Свернуто";
	РезультатЗапроса =Запрос.Выполнить();
	
	мГрузоперевозки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ВыбранныеКолонки 						= ПолучитьМассивВыбранныхКолонок();
	ВыборкаЗначенийДополнительныхКолонок 	= ПолучитьЗначенияДополнительныхКолонокТаблицыПодбора(ВыбранныеКолонки, мГрузоперевозки); 	
	СоответствиеПараметров 					= _ДС().СоответствиеПараметров;	

	РезультатПоиска.Очистить();
	Пока Выборка.Следующий() Цикл
		
		Если ИсключитьЗакрытыеПоФинансам и Выборка.ПризнакЗакрытия Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РезультатПоиска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ЗаполнитьЗначенияДопонительныхКолонокПоСтроке(НоваяСтрока, ВыборкаЗначенийДополнительныхКолонок, ВыбранныеКолонки, СоответствиеПараметров);

	КонецЦикла;
	
	Количество = РезультатПоиска.Количество();
	Элементы.ГруппаПоиск.Заголовок = "Поиск"+?(Количество=0,""," ("+Формат(Количество,"ЧЦ=15; ЧДЦ=0; ЧГ=")+")");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивВыбранныхКолонок()
	
	ВыбранныеКолонки = новый Массив;
	Для Каждого ЭлементСписка из СписокДопКолонок Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеКолонки.Добавить(ЭлементСписка.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеКолонки;

КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияДополнительныхКолонок(ИмяТаблицы, мГрузоперевозки)
	
	ТаблицаФормы 							= ЭтаФорма[ИмяТаблицы];
	ВыбранныеКолонки 						= ПолучитьМассивВыбранныхКолонок();
	ВыборкаЗначенийДополнительныхКолонок 	= ПолучитьЗначенияДополнительныхКолонокТаблицыПодбора(ВыбранныеКолонки, мГрузоперевозки); 	
	СоответствиеПараметров 					= _ДС().СоответствиеПараметров;	
	
	Для каждого Строкатаблицы Из ТаблицаФормы Цикл
		ЗаполнитьЗначенияДопонительныхКолонокПоСтроке(Строкатаблицы, ВыборкаЗначенийДополнительныхКолонок, ВыбранныеКолонки, СоответствиеПараметров);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияДопонительныхКолонокПоСтроке(ТекущаяСтрока, Знач ВыборкаЗначенийДополнительныхКолонок, Знач ВыбранныеКолонки, Знач СоответствиеПараметров)
	
	Для Каждого ЭлементМассива из ВыбранныеКолонки Цикл
		СтрокаСоответствия = СоответствиеПараметров.Получить(ЭлементМассива);
		
		Если СтрокаСоответствия.ЭтоПараметр Тогда
			ОтборВыборки = Новый Структура("Грузоперевозка,Параметр",ТекущаяСтрока.Ссылка,СтрокаСоответствия.Значение); 
		Иначе
			ОтборВыборки = Новый Структура("Грузоперевозка",ТекущаяСтрока.Ссылка); 
		КонецЕсли;
		
		Если  ВыборкаЗначенийДополнительныхКолонок <> Неопределено Тогда
			ВыборкаЗначенийДополнительныхКолонок.Сбросить();
			Если ВыборкаЗначенийДополнительныхКолонок.НайтиСледующий(ОтборВыборки) Тогда
				Если СтрокаСоответствия.ЭтоПараметр Тогда
					ТекущаяСтрока["_"+ЭлементМассива] =	ВыборкаЗначенийДополнительныхКолонок.Значение;
				Иначе
					ТекущаяСтрока["_"+ЭлементМассива] = ВыборкаЗначенийДополнительныхКолонок[СтрокаСоответствия.Значение];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры   

&НаКлиенте
Процедура РезультатПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Если РежимДвойногоКлика=ПредопределенноеЗначение("Перечисление.CW_ОбработкаДвойногоКликаВПодборе.Выбор") Тогда
		
		Выбор();
		
	ИначеЕсли РежимДвойногоКлика=ПредопределенноеЗначение("Перечисление.CW_ОбработкаДвойногоКликаВПодборе.Подбор") Тогда 
		
		_ДобавитьВПодбор(Элементы.РезультатПоиска.ВыделенныеСтроки);
		
	ИначеЕсли РежимДвойногоКлика=ПредопределенноеЗначение("Перечисление.CW_ОбработкаДвойногоКликаВПодборе.Открытие") Тогда 
		
		ОткрытьГрузоперевозку();
		
	КонецЕсли; 
	
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура КомандаОткрыть(Команда)
	
	ОткрытьГрузоперевозку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрузоперевозку()
	// --- 
	
	Если Элементы.РезультатПоиска.ТекущиеДанные <> Неопределено Тогда
		
		Попытка
			
			ПоказатьЗначение(,Элементы.РезультатПоиска.ТекущиеДанные.Ссылка);
			
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
// --- 
&НаКлиенте
Процедура ДобавитьВПодбор(Команда)
	
	 Если Элементы.РезультатПоиска.ТекущиеДанные <> Неопределено Тогда
		 
		 _ДобавитьВПодбор(Элементы.РезультатПоиска.ВыделенныеСтроки);
		 
	 КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура _ДобавитьВПодбор(ВыбранныеСтроки)
	
	ЕстьЗакрытые = Ложь;
	
	Для каждого Стр Из ВыбранныеСтроки Цикл
		
		СтрокаТЗ = РезультатПоиска.НайтиПоИдентификатору(Стр);
		
		Если СтрокаТЗ.ПризнакЗакрытия Тогда 
			ЕстьЗакрытые = Истина;
			Продолжить;
		КонецЕсли; 
		
		МассивНайденных = ТаблицаПодбора.НайтиСтроки(Новый Структура("Ссылка", СтрокаТЗ.Ссылка));
		
		Если МассивНайденных.Количество() = 0 Тогда
			
			Нстр = ТаблицаПодбора.Добавить();
			
			ЗаполнитьЗначенияСвойств(Нстр, СтрокаТЗ);
			
			Нстр.Грузоперевозка = СтрокаТЗ.Представление;
			//Нстр.Номер = СтрокаТЗ.Номер;
			//Нстр.Дата = СтрокаТЗ.Дата;
			//Нстр.Клиент = СтрокаТЗ.Клиент;
			//Нстр.Ссылка = СтрокаТЗ.Ссылка;
			//Нстр.ПометкаУдаления = СтрокаТЗ.ПометкаУдаления;
			//Нстр.Заказ = СтрокаТЗ.Заказ;	
			//Нстр.ПризнакЗакрытия = СтрокаТЗ.ПризнакЗакрытия;
			//Нстр.ИндексКартинки = СтрокаТЗ.ИндексКартинки;
			
		КонецЕсли; 
	КонецЦикла; 
	
	Если ЕстьЗакрытые Тогда
		_УФК.ВывестиПредупреждение("Грузоперевозки с блокированными финансами в документ не добавлены!");
	КонецЕсли; 

	ОбновитьЗаголовокПодбора();

КонецПроцедуры



&НаСервере
Процедура _ДобавитьВПодборИзЖурнала(МассивГрузоперевозок)
	// --- 
	
	ЕстьЗакрытые = Ложь;
	ТЗПодбора = ТаблицаПодбора.Выгрузить();
	
	Для каждого Стр Из МассивГрузоперевозок Цикл
		
		Если (_сф.к_НайтиСтроку(ТЗПодбора,Новый Структура("Ссылка",Стр)) <> Неопределено) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если (CW_Мониторинг.ПолучитьДатуЗакрытия(Стр) <> Дата(1,1,1)) Тогда
			
			ЕстьЗакрытые = Истина;
			Продолжить;
			
		КонецЕсли; 
		
		Нстр = ТаблицаПодбора.Добавить();
		Нстр.Грузоперевозка = Стр.CW_Представление;
		Нстр.Номер = Стр.Код;
		Нстр.Дата = Стр.ДатаСделкиФ;
		Нстр.Клиент = Стр.Клиент;
		Нстр.Ссылка = Стр;
		Нстр.ПометкаУдаления = Стр.ПометкаУдаления;
		Нстр.Заказ = Стр.Заказ;	
		Нстр.ПризнакЗакрытия = Ложь;
		Нстр.ИндексКартинки = ?(Стр.ПометкаУдаления, 4, 3);
		
	КонецЦикла; 
	// --- 
	Если ЕстьЗакрытые Тогда
		
		Сообщить("Закрытые грузоперевозки в подбор не добавлены!");
		
	КонецЕсли; 
	// --- 
	ОбновитьЗаголовокПодбора();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодбор(Команда)
	
	ТаблицаПодбора.Очистить();
	ОбновитьЗаголовокПодбора();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Выбор();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбор()
	// --- 
	
	Если ТаблицаПодбора.Количество()=0 Тогда
		
		Если Элементы.РезультатПоиска.ТекущиеДанные <> Неопределено Тогда
			
			// возвращаем текущу строку
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("Вариант","Грузоперевозка");
			СтруктураОтвета.Вставить("Грузоперевозка",Элементы.РезультатПоиска.ТекущиеДанные.Ссылка);
			ЭтаФорма.Закрыть(СтруктураОтвета);
			
		Иначе
			
			_УФК.ВывестиПредупреждение("Грузоперевозка не выбрана!");
			Возврат;
			
		КонецЕсли; 
		
	ИначеЕсли ТаблицаПодбора.Количество() > 0 Тогда 
		
		// проверяем, что в подборе нет помеченных на удаление
		//ЕстьПомеченные = Ложь;
		//Для каждого Стр Из ТаблицаПодбора Цикл
		//	Если (Стр.ПометкаУдаления) Тогда
		//		ЕстьПомеченные = Истина;
		//		Прервать;
		//	КонецЕсли; 
		//КонецЦикла; 
		////---- заменено на:
		ОтборПомеченных = Новый Структура("ПометкаУдаления", Истина);
		мСтроки 		= ТаблицаПодбора.НайтиСтроки(ОтборПомеченных);
		ЕстьПомеченные = мСтроки.Количество() > 0;
		
		Если (ЕстьПомеченные) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияПодбораПомеченных",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Подбор содержит помеченные на удаление грузоперевозки. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
			
		Иначе
			
			ПоказатьДиалогВыбораНоменклатуры();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияПодбораПомеченных(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			ПоказатьДиалогВыбораНоменклатуры();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ПоказатьДиалогВыбораНоменклатуры()
	
	// Вызываем форму выбора услуги
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораНоменклатуры",ЭтотОбъект);  
	
	СтруктураПараметров = ПолучитьПараметрыФормыВыбораНоменклатурыНаСервере(); 
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораНоменклатуры",СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаВыбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Вариант",					"ГрузоперевозкиИНоменклатура");
	СтруктураОтвета.Вставить("Грузоперевозки",			ПолучитьМассивГрузоперевозокНаСервере());
	СтруктураОтвета.Вставить("СтруктураНоменклатуры",	Результат);
	
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры
  

&НаСервере
Функция ПолучитьМассивГрузоперевозокНаСервере()
	
	Возврат ТаблицаПодбора.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции


&НаСервере
Функция ПолучитьПараметрыФормыВыбораНоменклатурыНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Валюта", 			Валюта);
	СтруктураПараметров.Вставить("ТипДокумента", 	ТипДокумента);
	СтруктураПараметров.Вставить("Договор", 		Договор);
	СтруктураПараметров.Вставить("РаздельныйУчетВходящегоНДС",  РаздельныйУчетВходящегоНДС);
	СтруктураПараметров.Вставить("ГруппировкаЗатратПоПодразделениям",  ГруппировкаЗатратПоПодразделениям);
	СтруктураПараметров.Вставить("ДатаДокумента",  ДатаДокумента);
	
	//Подсистема.УчетПриложенийДоговоров
	СтруктураПараметров.Вставить("ПриложениеКДоговору",  ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	Возврат СтруктураПараметров;
	
КонецФункции

// --- 

&НаКлиенте
Процедура ТаблицаПодбораПриИзменении(Элемент)
	
	ОбновитьЗаголовокПодбора();
	
КонецПроцедуры

Процедура ОбновитьЗаголовокПодбора()
	// --- 
	
	Количество = ТаблицаПодбора.Количество();
	Элементы.ГруппаПодбор.Заголовок = "Подбор"+?(Количество=0,""," ("+Формат(Количество,"ЧЦ=15; ЧДЦ=0; ЧГ=")+")");
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	мВыбранныеКолонки = Новый Массив;
	
	Для Каждого ЭлементСписка из СписокДопКолонок Цикл
		если ЭлементСписка.Пометка Тогда
			мВыбранныеКолонки.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ТекущийПараметр"	, ПараметрПоиска);
	Настройка.Вставить("ВыбранныеКолонки"	, мВыбранныеКолонки);
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,Настройка);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗаполнитьПоБюджету(Команда)
	
	Если ТаблицаПодбора.Количество() <> 0 Тогда	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Грузоперевозки", _ПолучитьОтобранныеГрузоперевозки());
		ПараметрыФормы.Вставить("Режим", "Подбор");
		ПараметрыФормы.Вставить("Договор", Договор);
		ПараметрыФормы.Вставить("УИД",ЭтаФорма.УникальныйИдентификатор);
		ПараметрыФормы.Вставить("ВидДоговора",_ВидДоговора(Договор));
		
		//Подсистема.УчетПриложенийДоговоров
		ПараметрыФормы.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаЗаполненияПоБюджету",ЭтотОбъект); 
		ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаЗаполненияПоБюджету", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияПоБюджету(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		ЭтаФорма.Закрыть(Ответ);
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ВидДоговора(Договор)
	// --- 
	
	Возврат(Договор.ВидДоговора);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ПолучитьОтобранныеГрузоперевозки()
	// --- 
	
	Возврат(ТаблицаПодбора.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура СортироватьВозр(Команда)
	
	Если Элементы.РезультатПоиска.ТекущийЭлемент <> Неопределено Тогда
		
		Если Элементы.РезультатПоиска.ТекущийЭлемент.Имя = "РезультатПоискаНомер" тогда
			СтрокаСортирвоки = "НомерГП Возр";
		Иначе
			СтрокаСортирвоки = СтрЗаменить(Элементы.РезультатПоиска.ТекущийЭлемент.Имя, "РезультатПоиска", "") + " Возр";
		КонецЕсли;
			
		РезультатПоиска.Сортировать(СтрокаСортирвоки);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьУбыв(Команда)
	
	Если Элементы.РезультатПоиска.ТекущийЭлемент <> Неопределено Тогда
		
		Если Элементы.РезультатПоиска.ТекущийЭлемент.Имя = "РезультатПоискаНомер" тогда
			СтрокаСортирвоки = "НомерГП Убыв";
		Иначе
			СтрокаСортирвоки = СтрЗаменить(Элементы.РезультатПоиска.ТекущийЭлемент.Имя, "РезультатПоиска", "") + " Убыв";
		КонецЕсли;

		РезультатПоиска.Сортировать(СтрокаСортирвоки);
	КонецЕсли;	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПодборПоЖурналу(Команда)
	
	МассивДоступных = Новый Массив;
	Для каждого Стр Из РезультатПоиска Цикл
		МассивДоступных.Добавить(Стр.Ссылка);
	КонецЦикла; 
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодбораИзЖурнала",ЭтотОбъект); 
	ПФ = Новый Структура("РежимВыбора,РежимОткрытия,МассивДоступных",Истина,"Подбор",МассивДоступных);
	ОткрытьФорму("Обработка.CW_ЖурналГрузоперевозок.Форма.Форма",ПФ, ЭтаФорма,Истина,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораИзЖурнала(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		_ДобавитьВПодборИзЖурнала(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОткрытьГрузоперевозку1(Команда)
	
	Попытка
		ПоказатьЗначение(,Элементы.ТаблицаПодбора.ТекущиеДанные.Ссылка);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаДополнительныеКолонкиНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений"	, ПолучитьДанныеДляПередачи());
	ПараметрыФормы.Вставить("СписокСПометками"		, Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Дополнительные колонки");
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСпискаПараметров", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наСервере
Функция ПолучитьДанныеДляПередачи()
	
	Возврат ПоместитьВоВременноеХранилище(СписокДопКолонок);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСпискаПараметров(Результат, ДопПараметры) Экспорт
 
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОбработатьРезультатВыбораКолонок(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораКолонок(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СписокКолонок = ПолучитьИзВременногоХранилища(Результат);
		СписокДопКолонок.Очистить();
		Для Каждого ЭлементСписка из СписокКолонок Цикл
			СписокДопКолонок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
		КонецЦикла;
		
		ДополнитьКолонкиПоиска();
		
		ЗаполнитьЗначенияДополнительныхКолонок("РезультатПоиска",РезультатПоиска.Выгрузить().ВыгрузитьКолонку("Ссылка"));
		ЗаполнитьЗначенияДополнительныхКолонок("ТаблицаПодбора"	,ТаблицаПодбора.Выгрузить().ВыгрузитьКолонку("Ссылка"));

		
	КонецЕсли;
	                                 
КонецПроцедуры

&наСервере
Процедура ДополнитьКолонкиПоиска()
	
    МассивДобавляемыхКолонокРезультатПоиска = Новый Массив;
	МассивУдаляемыхКолонокРезультатПоиска 	 = Новый Массив;
	
	МассивДобавляемыхКолонокТаблицаПодбора = Новый Массив;
	МассивУдаляемыхКолонокТаблицаПодбора   = Новый Массив;
	
	мТипыРеквизитв = Новый Массив;
	мТипыРеквизитв.Добавить(Тип("Строка"));
	мТипыРеквизитв.Добавить(Тип("Число"));
	мТипыРеквизитв.Добавить(Тип("Дата"));
	мТипыРеквизитв.Добавить(Тип("Булево"));
	мТипыРеквизитв.Добавить(Справочники.ТипВсеСсылки());
	
	РеквизитыТаблицыРезультатПоиска = ПолучитьРеквизиты("РезультатПоиска");
	РеквизитыТаблицыТаблицаПодбора  = ПолучитьРеквизиты("ТаблицаПодбора");
	
	мРеквизитыРезультатПоиска = Новый массив;
	Для Каждого Реквизит из РеквизитыТаблицыРезультатПоиска Цикл
		мРеквизитыРезультатПоиска.Добавить(Реквизит.имя);
	КонецЦикла;
	
	мРеквизитыТаблицаПодбора = Новый массив;
	Для Каждого Реквизит из РеквизитыТаблицыТаблицаПодбора Цикл
		мРеквизитыТаблицаПодбора.Добавить(Реквизит.имя);
	КонецЦикла;

	
	Для Каждого ЭлементСписка из СписокДопКолонок Цикл
		Если ЭлементСписка.Пометка тогда
			//РезультатПоиска
			Если мРеквизитыРезультатПоиска.Найти("_"+ЭлементСписка.Значение) = Неопределено Тогда
				МассивДобавляемыхКолонокРезультатПоиска.Добавить(Новый РеквизитФормы("_"+ЭлементСписка.Значение, Новый ОписаниеТипов(мТипыРеквизитв), "РезультатПоиска",ЭлементСписка.Представление,Ложь));
			КонецЕсли;
			//ТаблицаПодбора
			Если мРеквизитыТаблицаПодбора.Найти("_"+ЭлементСписка.Значение) = Неопределено Тогда
				МассивДобавляемыхКолонокТаблицаПодбора.Добавить(Новый РеквизитФормы("_"+ЭлементСписка.Значение, Новый ОписаниеТипов(мТипыРеквизитв), "ТаблицаПодбора",ЭлементСписка.Представление,Ложь));
			КонецЕсли;			
		Иначе
			УдаляемыйРеквизит = мРеквизитыРезультатПоиска.Найти("_"+ЭлементСписка.Значение);
			Если УдаляемыйРеквизит <> Неопределено Тогда
				МассивУдаляемыхКолонокРезультатПоиска.Добавить("РезультатПоиска."+мРеквизитыРезультатПоиска[УдаляемыйРеквизит]);
			КонецЕсли;
			//Пропускаем параметр поиска
			УдаляемыйРеквизит = мРеквизитыТаблицаПодбора.Найти("_"+ЭлементСписка.Значение);
			Если УдаляемыйРеквизит <> Неопределено Тогда
				МассивУдаляемыхКолонокТаблицаПодбора.Добавить("ТаблицаПодбора."+мРеквизитыТаблицаПодбора[УдаляемыйРеквизит]);
			КонецЕсли;
		КонецЕсли
		
	КонецЦикла;
	
	//РезультатПоиска
	ИзменитьРеквизиты(МассивДобавляемыхКолонокРезультатПоиска,МассивУдаляемыхКолонокРезультатПоиска);
	
	//ТаблицаПодбора
	ИзменитьРеквизиты(МассивДобавляемыхКолонокТаблицаПодбора,МассивУдаляемыхКолонокТаблицаПодбора);
	
	//Выводим на форме
	Для Каждого ЭлементСписка  из СписокДопКолонок Цикл
		Если ЭлементСписка.Пометка Тогда
			
			Если ЭтаФорма.Элементы.Найти("РезультатПоиска_"+ЭлементСписка.Значение) = Неопределено  тогда
				//РезультатПоиска
				нЭлемент = Элементы.Добавить("РезультатПоиска_"+ЭлементСписка.Значение, Тип("ПолеФормы"), Элементы.РезультатПоиска); 
				нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
				нЭлемент.ПутьКДанным = "РезультатПоиска."+"_"+ЭлементСписка.Значение;
				нЭлемент.ТолькоПросмотр = Истина;
				
				//ТаблицаПодбора
				нЭлемент = Элементы.Добавить("ТаблицаПодбора_"+ЭлементСписка.Значение, Тип("ПолеФормы"), Элементы.ТаблицаПодбора); 
				нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
				нЭлемент.ПутьКДанным = "ТаблицаПодбора."+"_"+ЭлементСписка.Значение;
				нЭлемент.ТолькоПросмотр = Истина;
			Конецесли;
			
		Иначе
			
			//РезультатПоиска_
			НайденныйЭлемент = Элементы.Найти("РезультатПоиска_"+ЭлементСписка.Значение);
			Если найденныйЭлемент <> Неопределено Тогда
				//Удаляем с формы
				Элементы.Удалить(НайденныйЭлемент);
			КонецЕсли;
			
			//ТаблицаПодбора
			НайденныйЭлемент = Элементы.Найти("ТаблицаПодбора_"+ЭлементСписка.Значение);
			Если найденныйЭлемент <> Неопределено Тогда
				//Удаляем с формы
				Элементы.Удалить(НайденныйЭлемент);
			КонецЕсли;
			
		Конецесли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоискаПриАктивизацииСтроки(Элемент)
	
	ВыделеноСтрок = Элементы.РезультатПоиска.ВыделенныеСтроки.Количество();
	
КонецПроцедуры

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда  
		ДоступностьКоманды = ПолучитьДоступностьКомандыБуфераОбмена();
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, ДоступностьКоманды);
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьДоступностьКомандыБуфераОбмена()
	
	ДанныеБуфераОбмена 	= CW_РаботаСБуферомОбмена.СтрокиИзБуфераОбмена(); 
	ТипИсточника		= CW_РаботаСБуферомОбмена.ПолучитьТипОбъектаПоИмени(ДанныеБуфераОбмена.Источник); 
	Возврат Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена() и (ТипИсточника = тип("СправочникСсылка.CW_Грузоперевозки"));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.БуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	ДанныеБуфераОбмена 	= CW_РаботаСБуферомОбмена.СтрокиИзБуфераОбмена(); 
	ТипИсточника		= CW_РаботаСБуферомОбмена.ПолучитьТипОбъектаПоИмени(ДанныеБуфераОбмена.Источник); 
	Если ТипИсточника <> тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат Неопределено;
	КонецЕсли;    
	
	МассивДобавленных = Новый Массив;
	Выборка = ПолучитьСведенияОДобавляемыхГрузоперевозках(ДанныеБуфераОбмена.Данные);
	Пока Выборка.Следующий() Цикл   
		МассивНайденных = ТаблицаПодбора.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Если МассивНайденных.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаПодбора.Добавить();
		НоваяСтрока.Грузоперевозка 	 = СокрЛП(Выборка.Грузоперевозка);
		НоваяСтрока.Заказ  			 = Выборка.Заказ;
		НоваяСтрока.Номер  			 = Выборка.Номер;
		НоваяСтрока.Дата   			 = Выборка.Дата;
		НоваяСтрока.Клиент 			 = Выборка.Клиент;
		НоваяСтрока.Ссылка  		 = Выборка.Ссылка;
		НоваяСтрока.ПризнакЗакрытия  = Выборка.ПризнакЗакрытия;
		НоваяСтрока.ПометкаУдаления  = Выборка.ПометкаУдаления;
		НоваяСтрока.ИндексКартинки   = ?(Выборка.ПометкаУдаления, 4, 3);   
		
		МассивДобавленных.Добавить(Выборка.Ссылка);
	КонецЦикла;    
	
	ЗаполнитьЗначенияДополнительныхКолонок("ТаблицаПодбора", МассивДобавленных);
	
	Возврат ДанныеБуфераОбмена.Данные.Количество();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСведенияОДобавляемыхГрузоперевозках(Знач ДанныеБуфераОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	CW_Грузоперевозки.CW_Представление КАК Грузоперевозка,
	               |	CW_Грузоперевозки.Код КАК Номер,
	               |	CW_Грузоперевозки.ДатаСделкиФ КАК Дата,
	               |	CW_Грузоперевозки.ПометкаУдаления КАК ПометкаУдаления,
	               |	CW_Грузоперевозки.Заказ КАК Заказ,
	               |	CW_Грузоперевозки.Клиент КАК Клиент,
	               |	ВЫБОР
	               |		КОГДА CW_ЗакрытиеФинансов.ДатаЗакрытия ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ПризнакЗакрытия
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	               |		ПО CW_Грузоперевозки.Ссылка = CW_ЗакрытиеФинансов.ДатаЗакрытия
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&ДанныеБуфераОбмена)"; 
	
	Запрос.УстановитьПараметр("ДанныеБуфераОбмена", ДанныеБуфераОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
	
КонецФункции
//Работа с буфером обмена
